## 이러닝_전처리

In [1]:
import pandas as pd
df = pd.read_csv('./FILE/iris_missing.csv')

In [2]:
df.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN

In [3]:
df_na = df.head(7)

In [5]:
df_na['Sepal_Length'].isna().sum() # 결측치 개수 세기

1

In [7]:
df_na.isna().sum()  #전체 결측치 개수 측정하기

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [8]:
df_na.isna().sum(axis = 1) # row 별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [10]:
df_na.fillna(value = {'Sepal_Length':999, # 부분만 fillna 입력
                      'Sepal_Width': 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [11]:
df_na.fillna(value = 999) # 전체 다 입력

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [12]:
df_na.Sepal_Length.mean()

4.949999999999999

In [13]:
df_na = df_na.fillna(value = {'Sepal_Width':df_na['Sepal_Width'].mean()})
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [16]:
df_na2 = df.head(7)
df_na2.dropna(how = 'all')

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [17]:
df_na2.iloc[:,:-1]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN

In [18]:
df.Sepal_Length.quantile() # 중위수

5.8

In [19]:
df.Sepal_Length.quantile(q = 0.25) #  제 1 사분위수 중위수
df.Sepal_Length.quantile(q = 0.50) #  제 2 사분위수 중위수
df.Sepal_Length.quantile(q = 0.75) #  제 3 사분위수 중위수

6.4

In [22]:
df.iloc[:,:-1].isna().sum().sum()

40

In [33]:
df.fillna(value = {'Sepal_Width':df.Sepal_Width.mean()}).var()

C:\Users\qwekl\AppData\Local\Temp\ipykernel_8308\2849729312.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.fillna(value = {'Sepal_Width':df.Sepal_Width.mean()}).var()

Sepal_Length    0.678277
Sepal_Width     0.175619
Petal_Length    3.062379
Petal_Width     0.590198
dtype: float64

In [37]:
sl_mean = df.Sepal_Length.mean()
sl_std = df.Sepal_Length.std() #표준편차
print(sl_mean)
print(sl_std)

5.8538461538461535
0.8235759566951737

In [38]:
cond_1 = df.Sepal_Length < (sl_mean -1.5 * sl_std)
cond_2 = df.Sepal_Length > (sl_mean + 1.5 * sl_std)
df_out = df.loc[(cond_1) | (cond_2), ]
len(df_out)

19

## 이러닝 파생변수

In [39]:
import pandas as pd
import numpy as np

In [42]:
df = pd.read_csv('./FILE/iris.csv')

In [43]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [45]:
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)

# setosa 면 1 이고 아니면 0 을 출력

In [49]:
pd.crosstab(df['Species'], df['is_setosa'])

# setosa 만 1 이 출력됨을 알 수 있음

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [55]:
df['is_setosa_2'] = (df.Species == 'setosa') + 0
df['is_setosa_3'] = (df.Species == 'setosa') * 1
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [56]:
df = df.rename(columns = {'Sepal.Length':'SL'})

In [57]:
df

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [5]:
import pandas as pd

bike = pd.read_csv('./FILE/bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [6]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [8]:
bike_sub = bike.iloc[:, 9:11]
bike_sub

       casual  registered
0           3          13
1           8          32
2           5          27
3           3          10
4           0           1
...       ...         ...
10881       7         329
10882      10         231
10883       4         164
10884      12         117
10885       4          84

[10886 rows x 2 columns]

In [9]:
bike_sub.apply(func = sum)

casual         392135
registered    1693341
dtype: int64

In [10]:
bike_sub.apply(func=sum, axis = 1)

0         16
1         40
2         32
3         13
4          1
        ...
10881    336
10882    241
10883    168
10884    129
10885     88
Length: 10886, dtype: int64

In [11]:
# 반올림

bike_sub.apply(func = lambda x: round(x.mean()))

casual         36
registered    156
dtype: int64

In [12]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      10886 non-null  int64
 1   registered  10886 non-null  int64
dtypes: int64(2)
memory usage: 170.2 KB

In [14]:
bike_sub['casual'].astype('str') +'대'

0         3대
1         8대
2         5대
3         3대
4         0대
        ...
10881     7대
10882    10대
10883     4대
10884    12대
10885     4대
Name: casual, Length: 10886, dtype: object

In [15]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [17]:
bike.datetime.str.slice(0,4)

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
10881    2012
10882    2012
10883    2012
10884    2012
10885    2012
Name: datetime, Length: 10886, dtype: object

In [20]:
bike.datetime.str.slice(5,7) +'월'

0        01월
1        01월
2        01월
3        01월
4        01월
        ...
10881    12월
10882    12월
10883    12월
10884    12월
10885    12월
Name: datetime, Length: 10886, dtype: object

In [21]:
bike_time = pd.to_datetime(bike['datetime'])
bike_time

0       2011-01-01 00:00:00
1       2011-01-01 01:00:00
2       2011-01-01 02:00:00
3       2011-01-01 03:00:00
4       2011-01-01 04:00:00
                ...
10881   2012-12-19 19:00:00
10882   2012-12-19 20:00:00
10883   2012-12-19 21:00:00
10884   2012-12-19 22:00:00
10885   2012-12-19 23:00:00
Name: datetime, Length: 10886, dtype: datetime64[ns]

In [23]:
print(bike_time.dt.year)
print(bike_time.dt.month)
print(bike_time.dt.hour)
print(bike_time.dt.time)

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
10881    2012
10882    2012
10883    2012
10884    2012
10885    2012
Name: datetime, Length: 10886, dtype: int64
0         1
1         1
2         1
3         1
4         1
         ..
10881    12
10882    12
10883    12
10884    12
10885    12
Name: datetime, Length: 10886, dtype: int64
0         0
1         1
2         2
3         3
4         4
         ..
10881    19
10882    20
10883    21
10884    22
10885    23
Name: datetime, Length: 10886, dtype: int64
0        00:00:00
1        01:00:00
2        02:00:00
3        03:00:00
4        04:00:00
           ...
10881    19:00:00
10882    20:00:00
10883    21:00:00
10884    22:00:00
10885    23:00:00
Name: datetime, Length: 10886, dtype: object

In [26]:
bike_dum = pd.get_dummies(data = bike, columns = ['season'], drop_first=True)
bike_dum

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0000,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0000,8,32,40,0,0,0
2,2011-01-01 02:00:00,0,0,1,9.02,13.635,80,0.0000,5,27,32,0,0,0
3,2011-01-01 03:00:00,0,0,1,9.84,14.395,75,0.0000,3,10,13,0,0,0
4,2011-01-01 04:00:00,0,0,1,9.84,14.395,75,0.0000,0,1,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,0,1,1,15.58,19.695,50,26.0027,7,329,336,0,0,1
10882,2012-12-19 20:00:00,0,1,1,14.76,17.425,57,15.0013,10,231,241,0,0,1
10883,2012-12-19 21:00:00,0,1,1,13.94,15.910,61,15.0013,4,164,168,0,0,1
10884,2012-12-19 22:00:00,0,1,1,13.94,17.425,61,6.0032,12,117,129,0,0,1
10885,2012-12-19 23:00:00,0,1,1,13.12,16.665,66,8.9981,4,84,88,0,0,1

In [34]:
bike['diff'] = bike.temp - bike.atemp
bike['diff'].abs().mean()

3.509198511850083

In [50]:
bike.datetime = pd.to_datetime(bike.datetime)

0        False
1        False
2        False
3        False
4        False
         ...
10881    False
10882    False
10883    False
10884    False
10885    False
Name: casual, Length: 10886, dtype: bool

In [81]:
bike.datetime = pd.to_datetime(bike.datetime)
bike['date'] = bike.datetime.dt.date
bike_agg = bike.groupby('date')['casual'].max()
bike_agg

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
              ..
2012-12-15    95
2012-12-16    67
2012-12-17    22
2012-12-18    58
2012-12-19    37
Name: casual, Length: 456, dtype: int64

In [83]:
bike_agg_up25 = bike_agg[bike_agg > 25]
len(bike_agg_up25)

384

### 시간대별 registered 평균을 산출했을 때 값이 가장 큰 시간은?

In [115]:
bike['hour'] = bike.datetime.dt.hour
bike_hour = bike.groupby('hour')['registered'].mean().reset_index()
bike_hour.loc[bike_hour.registered.idxmax()]

hour           17.000000
registered    393.324561
Name: 17, dtype: float64